<a href="https://colab.research.google.com/github/Drey-Tee/SQL/blob/main/SQL_Study_Plan_I.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Leetcode 595**: Big Countries

**Description** : Table: World

+-------------+------------------+

| Column Name | Type    |

+-------------+-------------------+

| name        | varchar           |

| continent   | varchar           |

| area        | int               |

| population  | int               |

| gdp         | int               |

+-------------+-------------------+

name is the primary key column for this table.
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or

it has a population of at least twenty-five million (i.e., 25000000).

Write an SQL query to report the name, population, and area of the big countries.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/big-countries/**

In [ ]:
# Write your MySQL query statement below
SELECT name, area, population
FROM World WHERE
area >= 3000000 OR population >= 25000000

**Leetcode 1757**: Recyclables and Low Fat Products

**Description** : Table: Products

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| product_id  | int     |

| low_fats    | enum    |

| recyclable  | enum    |

+-------------+---------+

product_id is the primary key for this table.
low_fats is an ENUM of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
recyclable is an ENUM of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.
 

Write an SQL query to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

**URL** : **https://leetcode.com/problems/recyclable-and-low-fat-products/**

In [ ]:
# Write your MySQL query statement below
SELECT product_id
FROM Products 
WHERE
low_fats = 'Y' AND recyclable = 'Y'

**Leetcode 584**: Find Customer Referee

**Description** : Table: Customer

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

| referee_id  | int     |

+-------------+---------+

id is the primary key column for this table.
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
 

Write an SQL query to report the names of the customer that are not referred by the customer with id = 2.

Return the result table in any order.


**URL** : **https://leetcode.com/problems/find-customer-referee/**

In [ ]:
# Write your MySQL query statement below
SELECT name
FROM Customer
WHERE referee_id !=2 OR referee_id is NULL;

**Leetcode 183**: Customers Who Never Order

**Description** : Table: Customers

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| name        | varchar |

+-------------+---------+

id is the primary key column for this table.
Each row of this table indicates the ID and name of a customer.
 

Table: Orders

+-------------+------+

| Column Name | Type |

+-------------+------+

| id          | int  |

| customerId  | int  |

+-------------+------+

id is the primary key column for this table.
customerId is a foreign key of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

Write an SQL query to report all customers who never order anything.

Return the result table in any order.


**URL** : **https://leetcode.com/problems/customers-who-never-order/**

In [ ]:
# Write your MySQL query statement below
SELECT name AS Customers 
FROM Customers 
WHERE id NOT IN (SELECT customerId FROM Orders)

**Leetcode 1873**: Calculate Special Bonus

**Description** : Table: Employees

+-------------+---------+


| Column Name | Type    |

+-------------+---------+

| employee_id | int     |


| name        | varchar |

| salary      | int     |

+-------------+---------+

employee_id is the primary key for this table.
Each row of this table indicates the employee ID, employee name, and salary.
 

Write an SQL query to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by employee_id.

**URL** : **https://leetcode.com/problems/calculate-special-bonus/**

In [ ]:
# Write your MySQL query statement below
SELECT employee_id, if(employee_id%2=1 AND name NOT LIKE 'm%', salary,0) AS bonus
FROM Employees ORDER BY employee_id;

**Leetcode 1873**: Swap Salary

**Description** : Table: Salary

+-------------+----------+

| Column Name | Type     |

+-------------+----------+

| id          | int      |

| name        | varchar  |

| sex         | ENUM     |

| salary      | int      |

+-------------+----------+

id is the primary key for this table.
The sex column is ENUM value of type ('m', 'f').
The table contains information about an employee.
 

Write an SQL query to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

**URL** : **https://leetcode.com/problems/swap-salary/**

In [ ]:
UPDATE Salary SET sex = CASE WHEN sex = 'f' THEN 'm' ELSE 'f' END

**Leetcode 196**: Delete Duplicate Emails

**Description** : Table: Person

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| id          | int     |

| email       | varchar |

+-------------+---------+

id is the primary key column for this table.

Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write an SQL query to delete all the duplicate emails, keeping only one unique email with the smallest id. Note that you are supposed to write a DELETE statement and not a SELECT one.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

**URL** : **https://leetcode.com/problems/delete-duplicate-emails/**

In [ ]:
# Please write a DELETE statement and DO NOT write a SELECT statement.
# Write your MySQL query statement below
DELETE tb1
FROM Person as tb1, Person as tb2
WHERE tb1.Email = tb2.Email AND tb1.Id > tb2.Id;

**Leetcode 1667**: Fix Names in a Table

**Description** : Table: Users

+----------------+---------+

| Column Name    | Type    |

+----------------+---------+

| user_id        | int     |

| name           | varchar |

+----------------+---------+

user_id is the primary key for this table.
This table contains the ID and the name of the user. The name consists of only lowercase and uppercase characters.
 

Write an SQL query to fix the names so that only the first character is uppercase and the rest are lowercase.

Return the result table ordered by user_id.

**URL** : **https://leetcode.com/problems/fix-names-in-a-table/**

In [ ]:
# Write your MySQL query statement below
SELECT user_id,
CONCAT(UCASE(LEFT(name,1)),LCASE(SUBSTRING(name,2))) as name
FROM Users ORDER BY user_id;

**Leetcode 1484**: Group Sold Products By Date

**Description** : Table Activities:

+-------------+---------+

| Column Name | Type    |

+-------------+---------+

| sell_date   | date    |

| product     | varchar |

+-------------+---------+

There is no primary key for this table, it may contain duplicates.
Each row of this table contains the product name and the date it was sold in a market.
 

Write an SQL query to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

**URL** : **https://leetcode.com/problems/group-sold-products-by-the-date/**

In [ ]:
# Write your MySQL query statement below
SELECT sell_date,
		COUNT(DISTINCT(product)) AS num_sold, 
		GROUP_CONCAT(DISTINCT product ORDER BY product ASC) AS products
FROM Activities
GROUP BY sell_date
ORDER BY sell_date ASC

**Leetcode 1527**: Patients With a Condition

**Description** : Table: Patients

+--------------+---------+

| Column Name  | Type    |

+--------------+---------+

| patient_id   | int     |

| patient_name | varchar |

| conditions   | varchar |

+--------------+---------+

patient_id is the primary key for this table.
'conditions' contains 0 or more code separated by spaces. 
This table contains information of the patients in the hospital.
 

Write an SQL query to report the patient_id, patient_name all conditions of patients who have Type I Diabetes. Type I Diabetes always starts with DIAB1 prefix

Return the result table in any order.

**URL** : **https://leetcode.com/problems/patients-with-a-condition/**

In [ ]:
# Write your MySQL query statement below
SELECT *
FROM
    Patients
WHERE
    conditions LIKE 'DIAB1%'
    OR conditions LIKE '% DIAB1%'